{
  "name": "Nyxian",
  "subtitle": "The Latest Nyxian Build",
  "description": "Here you will find the latest weekly build of Nyxian",
  "iconURL": "https://i.imgur.com/75nxNZM.png",
  "tintColor": "#6156e2",
  "featuredApps": [
    "com.cr4zy.nyxian"
  ],
  "apps": [
    {
      "name": "Nyxian",
      "bundleIdentifier": "com.cr4zy.nyxian",
      "developerName": "Project Nyxian",
      "subtitle": "",
      "localizedDescription": "Nyxian is a iOS application for iOS 16.0 and above(iOS 26 latest beta tested) that empowers iOS users to code, compile, link, sign and even execute/rapid test iOS applications directly on their device! It is the successor of the former FridaCodeManager project, which was deprecated in favor of Nyxian, because FridaCodeManager requires a jailbreak to work while Nyxian does not.",
      "iconURL": "https://i.imgur.com/Tn60ziY.png",
      "tintColor": "#aa80dc",
      "category": "developer",
      "screenshots": [],
      "versions": [
        {
          "downloadURL": "https://github.com/jurre111/Nyxian/raw/refs/heads/main/Resources/App/Nyxian.ipa",
          "size": 155111557,
          "version": "0.7",
          "buildVersion": "20251125a",
          "date": "2025-11-25T11:18:04Z",
          "localizedDescription": "### Changelog\r\\n- Fixed some problems with utility support, such as the keyboard not appearing(next build I gonna fix the touch problems on  dw)\r\\n- Fixed iPhone support of Nyxian.\r\\n- Replaced seqlock with my new low level reflock which makes Nyxians kernel API much more lightweight and easy to use, less prone to fail.\r\\n- Added headless application v2, the new one is not hook based anymore.\r\\n- Fixed the full screen stutter some people reported on the bottom of their screens.\r\\n- Added entitlement config to projects, now you can set nyxian entitlements directly at development of your apps.\r\\n- Switched to iOS 26 SDK.\r\\n- Added a new project config key  which sets the version you wanna target as the highest iOS version, if you dont want Liquid Glass in your app then you shall set it to  for example while  sets the version you wanna have at minimum.\r\\n- Fixed a few more sysctl syscalls such as , and .\r\\n- Made killing processes which have more Childs faster and more efficient, shall be now 2.5 times faster, than before.\r\\n- Fixed a vulnerability regarding  in which a process while elevation triggers on a other thread the same elevation which causes unexpected process structure corruption, was addressed by implementing reflock as mentioned above.\r\\n- Added  as a security feature to harden daemons in the process model so normal processes cannot interact with them like with normal processes running in Nyxian.\r\\n- Added  as another security feature to prevent privilege escalations, such as a sandboxed process executing a application that has at trust cache level more entitlements, if a vulnerability exists in the privileged binary then the sandboxed process could easier exploit that. While that daemons and nyxian doesnt have that entitlement set in its entitlement layer, because Nyxian shall not inherit its entitlements to the child process lol. Its a curse of unbinding entitlement, when a process has it all process it spawns have the same entitlements as it self 1:1.",
          "minOSVersion": null
        },
        {
          "downloadURL": "https://github.com/jurre111/Nyxian/raw/refs/heads/main/Resources/App/Nyxian.ipa",
          "size": 155132209,
          "version": "0.7",
          "buildVersion": "20251122a",
          "date": "2025-11-22T10:06:39Z",
          "localizedDescription": "### Caution\r\niPad Only Build again\r\n\r\nThis build is mostly improvements. Improvements mandatory to push further.\r\n\r\n### Changelog\r\n- Rewrote window gestures to be intuitive\r\n- Improved window design.\r\n- Animated windows.\r\n- Fixed Utility development\r\n- Fixed Process tree recursive killing\r\n- Fixed vulnerability in seqlock\r\n- Fixed vulnerability in PEEntitlementSpawnSignedOnly handling\r\n- Fixed up ServerSession code.",
          "minOSVersion": null
        }
      ],
      "appPermissions": {
        "entitlements": [],
        "privacy": {}
      }
    }
  ],
  "news": []
}
